# Тема 2. Базовые операции языка Python
Отчет по теме 2 выполнил:
- Фильков Константин Павлович
- АИС-22-1


| Задание | Лаб_раб | Сам_раб |
| ------------- | ------------- | ------------- |
| Задание 1 | + | + |
| Задание 2 | + | + |
| Задание 3 | + | + |
| Задание 4 | + | + |
| Задание 5 | + | + |
| Задание 6 | + | + |
| Задание 7 | + | + |
| Задание 8 | + | + |
| Задание 9 | + | + |
| Задание 10 | + | + |

знак "+" - задание выполнено; знак "-" - задание не выполнено;

Работу проверили:
- к.э.н., доцент Панов М.А.

  ## Лабораторная работа №2
### 1) Выведите в консоль три строки. Первая – любое число. Вторая – любое число в виде строки. Третья – любое число с плавающей точкой.
```python
print(123)
print('123')
print(1.23)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/1.jpg)

### 2) Выведите в консоль три строки. Первая – результат сложения или вычитания минимум двух переменных типа int. Вторая – результат сложения или вычитания минимум двух переменных типа float. Третья – результат сложения или вычитания минимум двух переменных типа int и float.
```python
print(1823 - 486)
print(5.1 + 8.27)
print(3 + 7.04 + 1 + 2.33)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/2.jpg)


### 3) Выведите в консоль три строки. Первая – обычная строка. Вторая – F строка с использованием заранее объявленной переменной. Третья – сложите две или более строк в одну.
```python
print('Привет Мир!')

world = 'Мир'
print(f"Привет, {world}!")

one = 'Привет'
two = 'Мир!'
print(one + two)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/3.jpg)

### 4) Выведите в консоль три строки. Первая – трансформация любого типа переменной в bool. Вторая – трансформация любого типа переменной в float или int. Третья – трансформация любого типа переменной в str.

```python
one = 'hello'
print(bool(one))

two = 142
print(float(two))

three = none
print(str(three))
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/4.jpg)


### 5) Присвойте трем переменным различные значения, воспользовавшись функцией input().
```python
one = input('one:')
two = input('two:')
three = input('three:')
print(one, two, three)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/5.jpg)


### 6) Создайте две любые числовые переменные и выполните над ними несколько математических операций: возведение в степень, обычное деление, целочисленное деление, нахождение остатка от деления. При желании вы можете проверить как работают эти вычисления с разными типами данных, например, сначала создать две переменные int, затем создать две переменные float и наконец создать переменные типа int и float и провести над ними операции, прописанные выше. 
```python
a = 12
b = 5
print('возведение в степень:", a ** b)
print('обычное деление:', a / b)
print("целочисленное деление:', a // b)
print('Нахождение остатка от деления:', a % b)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/6.jpg)


### 7) Создайте любую строковую переменную и произведите над ней математическое действие умножение на любое число.
```python
line = 'hello!'
print(line * 6)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/7.jpg)


### 8) Посчитайте сколько раз символ ‘o’ встречается в строке ‘Hello World’.
```python
sentence = 'hello world'
print(sentence.count('o'))
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/8.jpg)


### 9) Напишите предложение ‘Hello World’ в две строки. Написанная программа должна занимать одну строку в редакторе кода.
```python
print('Hello\nWorld')
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/9.jpg)


### 10) Из предложения ‘Hello World’ выведите в консоль только 2 символ, а затем выведите слово ‘Hello’
```python
sentence = 'Hello World'
print(sentence[1])
print(sentence[:5])
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/10.jpg)


  ## Самостоятельная работа №2. 
### 1) Выведите в консоль булевую переменную False, не используя слово False в строке или изначально присвоенную булевую переменную. Программа должна занимать не более двух строк редактора кода
```python
print(0 ==1)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/11.jpg)
### Вывод
Эта программа выведет булеву переменную False, сравнивая два неравных значения 0 и 1.

### 2) Присвоить значения трем переменным и вывести их в консоль, используя только две строки редактора кода
```python
a, b, c = 24, 74, 284
print(a, b, c)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/12.jpg)
### Вывод
Программа присваивает значения переменным a, b и c, а затем выводит их в одной строке с помощью функции print()

### 3) Реализуйте ввод данных в программу, через консоль, в виде только целых чисел (тип данных int). То есть при вводе буквенных символов в консоль, программа не должна работать. Программа должна занимать не более двух строк редактора кода.
```python
x = int(input())
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/13.jpg)
### Вывод
Программа ожидает ввода целого числа от пользователя с помощью функции input() и преобразует его в тип int. Если пользователь введет что-то, что не может быть преобразовано в целое число, программа выдаст ошибку.

### 4) Создайте только одну строковую переменную. Длина строки должна не превышать 5 символов. На выходе мы должны получить строку длиной не менее 16 символов. Программа должна занимать не более двух строк редактора кода.

```python
s = "абвг"
print(s * 6)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/14.jpg)
### Вывод
Программа создает строковую переменную s, содержащую 4 символа, и выводит строку, полученную путем её повторения 6 раз. Таким образом, на выходе мы получаем строку длиной 24 символа. 

### 5) Создайте три переменные: день (тип данных - числовой), месяц (тип данных - строка), год (тип данных - числовой) и выведите в консоль текущую дату в формате: “Сегодня день месяц год. Всего хорошего!” используя F строку и оператор end внутри print(), в котором вы должны написать фразу “Всего хорошего!”. Программа должна занимать не более двух строк редактора кода.
```python
day, month, year = 16, "сентября", 2024
print(f"Сегодня {day} {month} {year}.", end=" Всего хорошего!")
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/15.jpg)
### Вывод
Программа создает три переменные для текущей даты: day (числовой), month (строковый) и year (числовой). Затем с помощью F-строки форматируется строка, которая выводит дату на консоль, добавляя фразу "Всего хорошего!" с помощью параметра end в функции print(). 

### 6) В предложении ‘Hello World’ вставьте ‘my’ между двумя словами. Выведите полученное предложение в консоль в одну строку. Программа должна занимать не более двух строк редактора кода
```python
result = 'Hello ' + 'my ' + 'World'
print(result)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/16.jpg)
### Вывод
Программа создает строку, в которой слово "my" вставлено между словами "Hello" и "World" с помощью конкатенации. Затем полученное предложение выводится в консоль.

### 7) Узнайте длину предложения ‘Hello World’, результат выведите в консоль. Программа должна занимать не более двух строк редактора кода
```python
sentence = 'Hello World'
print(len(sentence))
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/17.jpg)
### Вывод
Программа вычисляет длину строки "Hello World" и выводит результат в консоль.

### 8) Переведите предложение ‘HELLO WORLD’ в нижний регистр. Программа должна занимать не более двух строк редактора кода
```python
text = "HELLO WORLD"
print(text.lower())
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/18.jpg)
### Вывод
Программа переводит строку "HELLO WORLD" в нижний регистр и выводит результат в консоль.

### 9) Создайте программу, которая будет принимать число (n), введенное пользователем, и выдавать результат в виде (n*7+n*25-n*11).
```python
n=int(input())
print(n*7+n*25-n*11)
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/19.jpg)
### Вывод
Программа принимает целое число n, введенное пользователем, и выводит результат вычисления выражения (n * 7 + n * 25 - n * 11).

### 10) Создайте программу, что будет запрашивать данные пользователя: имя, фамилию, возраст и будет выводить их на экран.
```python
name = input("Ваше имя: ")
surname = input("Ваша фамилия: ")
age = input("Ваш возраст: ")
print(f"Ваше имя и фамилия: {name} {surname}, ваш возраст {age}.")
```

### Результат
![Меню](https://github.com/Soleeek30/-/blob/Theme_2/pics2/20.jpg)
### Вывод
Программа запрашивает у пользователя его данные: имя, фамилию и возраст, а затем выводит их в удобочитаемом формате.

 ## Вывод
- В Python комментарии используются для добавления пояснений и делают код более понятным. 
- Функция print() выводит текст или значения переменных и имеет параметры, такие как sep, end, file, и flush.
- Тип переменной в Python определяется автоматически. Основные типы включают числа, строки, списки, кортежи, словари, множества и булев тип. 
- NoneType, представляющий значение None, помогает инициализировать переменные без конкретного значения, что удобно для последующих изменений или сравнения. 
- Конвертацию между типами данных можно осуществлять с помощью встроенных функций, таких как float(), bool(), list(), tuple(), set() и dict().
- F-строки в Python позволяют вставлять значения переменных и выражений в строки, используя префикс "f" и фигурные скобки{}. 
- Для ввода данных через консоль используется функция input(). 
- Кроме того, в функции print() можно выполнять математические операции наряду с выводом текстовой информации и значений переменных.
